#+TITLE: Shahin's Home lab
#+auto_tangle: t

** Security

First I tried to implement the security by following [[https://bjpcjp.github.io/pdfs/devops/ansible-server-security.pdf][Ansible Server Security]]
document. However, then realized there is a project called [[https://github.com/dev-sec/ansible-collection-hardening][Ansible Collection
Hardening]] which would be more helpful if possible to use. So going to give it a
try.

#+begin_src sh
ansible-galaxy collection install devsec.hardening
#+end_src

#+RESULTS:
| Starting                | galaxy                                                             | collection | install                                                                                                 | process |
| Process                 | install                                                            | dependency | map                                                                                                     |         |
| Starting                | collection                                                         | install    | process                                                                                                 |         |
| Downloading             | https://galaxy.ansible.com/download/devsec-hardening-7.14.1.tar.gz | to         | /home/shahinazad/.ansible/tmp/ansible-local-214361xxk0k__t/tmpavdbtwlf/devsec-hardening-7.14.1-_43xr5sz |         |
| Installing              | 'devsec.hardening:7.14.1'                                          | to         | '/home/shahinazad/.ansible/collections/ansible_collections/devsec/hardening'                            |         |
| devsec.hardening:7.14.1 | was                                                                | installed  | successfully                                                                                            |         |
| Downloading             | https://galaxy.ansible.com/download/ansible-posix-1.3.0.tar.gz     | to         | /home/shahinazad/.ansible/tmp/ansible-local-214361xxk0k__t/tmpavdbtwlf/ansible-posix-1.3.0-lwhm8lz_     |         |
| Installing              | 'ansible.posix:1.3.0'                                              | to         | '/home/shahinazad/.ansible/collections/ansible_collections/ansible/posix'                               |         |
| ansible.posix:1.3.0     | was                                                                | installed  | successfully                                                                                            |         |
| Downloading             | https://galaxy.ansible.com/download/community-mysql-3.1.1.tar.gz   | to         | /home/shahinazad/.ansible/tmp/ansible-local-214361xxk0k__t/tmpavdbtwlf/community-mysql-3.1.1-30d2s0dp   |         |
| Installing              | 'community.mysql:3.1.1'                                            | to         | '/home/shahinazad/.ansible/collections/ansible_collections/community/mysql'                             |         |
| community.mysql:3.1.1   | was                                                                | installed  | successfully                                                                                            |         |
| Downloading             | https://galaxy.ansible.com/download/community-crypto-2.2.2.tar.gz  | to         | /home/shahinazad/.ansible/tmp/ansible-local-214361xxk0k__t/tmpavdbtwlf/community-crypto-2.2.2-a2nlpq41  |         |
| Installing              | 'community.crypto:2.2.2'                                           | to         | '/home/shahinazad/.ansible/collections/ansible_collections/community/crypto'                            |         |
| community.crypto:2.2.2  | was                                                                | installed  | successfully                                                                                            |         |
| Downloading             | https://galaxy.ansible.com/download/community-general-4.5.0.tar.gz | to         | /home/shahinazad/.ansible/tmp/ansible-local-214361xxk0k__t/tmpavdbtwlf/community-general-4.5.0-l3tnxy7o |         |
| Installing              | 'community.general:4.5.0'                                          | to         | '/home/shahinazad/.ansible/collections/ansible_collections/community/general'                           |         |
| community.general:4.5.0 | was                                                                | installed  | successfully                                                                                            |         |

